In [203]:
import pandas as pd

In [204]:
shootings_df = pd.read_csv('sources (unedited)/pah_wikp_combo.csv')

In [205]:
shootings_df.head()

,Date,City,State,AreaType,School,Fatalities,Wounded,Dupe,Source,Desc,Unnamed: 10,Unnamed: 11
0,3/27/1990,Brooklyn,New York,NaN,C,0,1.0,NaN,Wikp,A black youth was taunted with racial slurs by...,NaN,NaN
1,5/20/1990,Centerville,Tennessee,suburban,HS,1,NaN,NaN,Pah,NaN,NaN,NaN
2,8/26/1990,Las Vegas,Nevada,urban,HS,1,NaN,NaN,Pah,NaN,NaN,NaN
3,9/11/1990,San Antonio,Texas,NaN,HS,0,3.0,NaN,Wikp,3 students were wounded when gunfire broke out...,NaN,NaN
4,1/8/1991,Richardson,Texas,urban,HS,0,NaN,NaN,Pah,NaN,NaN,NaN

#### dropping the last 5 col

In [206]:
shootings_df = shootings_df.drop(shootings_df.columns[-5:], axis=1)

In [207]:
shootings_df.head()

        Date         City      State  AreaType School  Fatalities  Wounded
0  3/27/1990     Brooklyn   New York       NaN      C           0      1.0
1  5/20/1990  Centerville  Tennessee  suburban     HS           1      NaN
2  8/26/1990    Las Vegas     Nevada     urban     HS           1      NaN
3  9/11/1990  San Antonio      Texas       NaN     HS           0      3.0
4   1/8/1991   Richardson      Texas     urban     HS           0      NaN

#### null values for each column

In [208]:
shootings_df.isnull().sum()

Date            0
City            0
State           0
AreaType      469
School          6
Fatalities      0
Wounded       381
dtype: int64

#### number of records

In [209]:
shootings_df.shape[0]

850

#### dropping rows where 'School' is null , as they aren't many.

In [210]:
shootings_df = shootings_df.dropna(subset=['School'])

#### dropping 'Wounded' and 'AreaType' due to many missing values

In [211]:
shootings_df = shootings_df.drop('Wounded', axis=1)
shootings_df = shootings_df.drop('AreaType', axis=1)

In [212]:
shootings_df.head()

        Date         City      State School  Fatalities
0  3/27/1990     Brooklyn   New York      C           0
1  5/20/1990  Centerville  Tennessee     HS           1
2  8/26/1990    Las Vegas     Nevada     HS           1
3  9/11/1990  San Antonio      Texas     HS           0
4   1/8/1991   Richardson      Texas     HS           0

#### no more null values

In [213]:
shootings_df.isnull().sum()

Date          0
City          0
State         0
School        0
Fatalities    0
dtype: int64

In [214]:
shootings_df.shape[0]

844

#### checking duplicates

In [215]:
shootings_df.duplicated().sum()

107

#### dropping duplicates

In [216]:
shootings_df = shootings_df.drop_duplicates()

In [217]:
shootings_df.duplicated().sum()

0

#### number of rows with the same date (probably a duplicate)

In [218]:
shootings_df.duplicated(subset=['Date']).sum()

80

#### dropping rows with the same date

In [219]:
shootings_df = shootings_df.drop_duplicates(subset=['Date'])

In [220]:
shootings_df.duplicated(subset=['Date']).sum()

0

#### dropping rows where 'School' = '-'

In [221]:
shootings_df = shootings_df[shootings_df['School'] != '-']

#### exporting the df to csv

In [222]:
shootings_df.to_csv('shootingsData.csv', index=False)